const initialState = {
  partOfState: {
    id: 'AboutUs',
    name: 'AboutUs',
    t1: 'Про нас',
    p1: 'Громадська організація «Фонд рятування дітей та підлітків України від наркотиків» створена 1997 році в Харкові з метою допомогти суспільству розв\'язати проблему молодіжної наркоманії.\nФонд не намагається замінити медичні наркологічні служби або відповідні державні установи. Натомість ми є помічниками для всіх, хто працює задля оздоровлення нашого суспільства й пропагує здоровий спосіб життя.\nЄдиною метою Фонду є припинення розповсюдження наркоманії серед дітей та підлітків, а головною задачею – якомога більше здорових і благополучних дітей, які не вживають наркотики.',
    t2: 'Що ми робимо:',
    p2: '- проводимо безкоштовні профілактичні лекції для школярів, студентів, батьків і педагогів в різних регіонах України (з 1997 до 2020 року проведено понад 10 100 лекцій);\n- проводимо семінари для підлітків, батьків, педагогів;\n- розробляємо та розповсюджуємо друковані матеріали: щороку до 10 тис. Антинаркотичних - інформаційних буклетів розповсюджуються у навчальних закладах;\n- проводимо щорічні літні наметові табори та походи зі “складними” підлітками (з 2002 року);\n- проводимо безкоштовні анонімні консультації з питань наркоманії.',
    t3: ' ',
    p3: 'Фонд готовий до співпраці з різноманітними організаціями, які ефективно діють у сфері зниження розповсюдження наркотиків серед дітей та підлітків.\nМи можемо провести лекцію в будь-якому населеному пункті України — з виїздом лектора або онлайн. Щоб замовити лекцію — натисніть сюди.',
  }
}

const aboutUsreducer = (state = initialState, action) => {
  switch (action.type) {

    default:
      return { ...state };
  }
};

export default aboutUsreducer;